slackGPT/issue_misc_error/3 RebookAndReprice Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">7610366f-2a33-4e88-8505-de16559a82d7
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">
            http://webservices.amadeus.com/Ticket_RebookAndRepricePNR_1.0
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0FG857CMY0</wsse:SessionId>
            <wsse:SequenceNumber>2</wsse:SequenceNumber>
            <wsse:SecurityToken>3UA5111BN9U891JW8ADD32MXX4</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:AMA_TicketRebookAndRepricePNRRQ xmlns:ns0="http://xml.amadeus.com/2010/06/Ticket_RebookAndRepricePNR_v1"
                                             Actions="" Version="1.0">
            <ns0:Reservation BookingIdentifier="3WKL5P"/>
            <ns0:Commit IgnoreWarningsOption="true" ReceivedFrom="Amadeus WBS"/>
            <ns0:Rebooking>
                <ns0:Cancellation>
                    <ns1:Ref xmlns:ns1="http://xml.amadeus.com/2010/06/Retailing_Types_v2" TattooType="ST"
                             TattooValue="1"/>
                </ns0:Cancellation>
                <ns0:Bounds>
                    <ns0:Bound NIP="1" ActionCode="NN">
                        <ns0:Segment bkgClass="G" isOpenSegment="false" RequestID="SEG1">
                            <ns2:serviceProvider xmlns:ns2="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                                 code="AA"/>
                            <ns3:identifier xmlns:ns3="http://xml.amadeus.com/2010/06/Retailing_Types_v2">274
                            </ns3:identifier>
                            <ns4:start xmlns:ns4="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                       dateTime="2023-08-22T12:21:00">
                                <ns4:locationCode>LAX</ns4:locationCode>
                            </ns4:start>
                            <ns5:end xmlns:ns5="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                     dateTime="2023-08-22T21:00:00">
                                <ns5:locationCode>JFK</ns5:locationCode>
                            </ns5:end>
                        </ns0:Segment>
                    </ns0:Bound>
                </ns0:Bounds>
            </ns0:Rebooking>
            <ns0:Repricing>
                <ns0:ItineraryPricingOptions>
                    <ns0:ItineraryPricingOption>
                        <ns6:TicketingInfo xmlns:ns6="http://xml.amadeus.com/2010/06/PricingTypes_v4"
                                           Number="0018005323634"/>
                        <ns7:Booking xmlns:ns7="http://xml.amadeus.com/2010/06/PricingTypes_v4" Operation="SEL"/>
                        <ns8:AssociatedPNRElement xmlns:ns8="http://xml.amadeus.com/2010/06/FareInternalTypes_v2"
                                                  Type="PT" Tattoo="2"/>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns9:TicketingInfo xmlns:ns9="http://xml.amadeus.com/2010/06/PricingTypes_v4">
                            <ns9:FareFamily Name="MAIN" Owner="FF"/>
                        </ns9:TicketingInfo>
                        <ns10:AssociatedPNRElement xmlns:ns10="http://xml.amadeus.com/2010/06/FareInternalTypes_v2"
                                                   RefIDs="SEG1"/>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns11:ServiceProvider xmlns:ns11="http://xml.amadeus.com/2010/06/PricingTypes_v4" Type="VC">AA
                        </ns11:ServiceProvider>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns12:NegotiatedFare xmlns:ns12="http://xml.amadeus.com/2010/06/PricingTypes_v4" Type="RP"/>
                    </ns0:ItineraryPricingOption>
                </ns0:ItineraryPricingOptions>
            </ns0:Repricing>
        </ns0:AMA_TicketRebookAndRepricePNRRQ>
    </soap-env:Body>
</soap-env:Envelope>
